{
  "terms": [
    {
      "sections": [
        {
          "title": "Interpretation and Definitions",
          "subsections": [
            {
              "subtitle": "Interpretation",
              "content": "The words of which the initial letter is capitalized have meanings defined under the following conditions. The following definitions shall have the same meaning regardless of whether they appear in singular or in plural."
            },
            {
              "subtitle": "Definitions",
              "content": "For the purposes of these Terms and Conditions :"
            },
            {
              "definitionList": [
                {
                  "term": "Application",
                  "definition": "means the software program provided by the Company downloaded or added to a Platform by You on any electronic device, named Agent and/or Agent Connect."
                },
                {
                  "term": "Application Store",
                  "definition": "means the digital distribution service operated and developed by Apple Inc. (Apple App Store) or Google Inc. (Google Play Store) in which the Application has been downloaded."
                },
                {
                  "term": "Affiliate",
                  "definition": "means an entity that controls, is controlled by or is under common control with a party, where 'control' means ownership of 50% or more of the shares, equity interest or other securities entitled to vote for election of directors or other managing authority."
                },
                {
                  "term": "Country",
                  "definition": "refers to United States."
                },
                {
                  "term": "Company",
                  "definition": "refers to Agent, ADRESSE."
                },
                {
                  "term": "Device",
                  "definition": "means any device that can access the Service including but not limited to a computer, a cellphone, or a digital tablet."
                },
                {
                  "term": "Feedback",
                  "definition": "means feedback, innovations, or suggestions sent by You regarding the attributes, performance, or features of our Service."
                },
                {
                  "term": "Goods",
                  "definition": "refer to the items offered for sale on the Service for a one-time payment."
                },
                {
                  "term": "Orders",
                  "definition": "mean a request by You to purchase Goods from Us."
                },
                {
                  "term": "Platform",
                  "definition": "is any third-party that the Service is made possible through the download of the Application to their service."
                },
                {
                  "term": "Promotions",
                  "definition": "refer to contests, sweepstakes, or other promotions offered through the Service."
                },
                {
                  "term": "Service",
                  "definition": "refers to the Application."
                },
                {
                  "term": "Subscriptions",
                  "definition": "refer to the services or access to the Service offered on a subscription basis by the Company to You."
                },
                {
                  "term": "Terms and Conditions",
                  "definition": "mean these Terms and Conditions that form the entire agreement between You and the Company regarding the use of the Service."
                },
                {
                  "term": "Third-party Social Media Service",
                  "definition": "means any services or content (including data, information, products or services) provided by a third-party social media platform that may be displayed, included, or made available by the Service."
                },
                {
                  "term": "Third-party Website",
                  "definition": "means any services or content (including data, information, products, or services) provided by a third-party website that may be displayed, included, or made available by the Service."
                },
                {
                  "term": "Website",
                  "definition": "refers to Agent’s website, accessible from https://agent-bfcommunity.com."
                },
                {
                  "term": "You",
                  "definition": "means the individual accessing or using the Service, or the company, or other legal entity on behalf of which such individual is accessing or using the Service, as applicable."
                }
              ]
            }
          ]
        },
        {
          "title": "Acknowledgment",
          "content": "These are the Terms and Conditions governing the use of this Service and the agreement that operates between You and the Company. These Terms and Conditions set out the rights and obligations of all users regarding the use of the Service."
        },
        {
          "title": "Placing Orders for Goods",
          "content": "By placing an Order for Goods through the Service, You warrant that You are legally capable of entering into binding contracts."
        },
        {
          "title": "Your Information",
          "content": "If You wish to place an Order for Goods available on the Service, You may be asked to supply certain information relevant to Your Order including, without limitation, Your name, Your email, Your phone number, Your credit card number, the expiration date of Your credit card, Your billing address, and Your shipping information."
        },
        {
          "title": "Order Cancellation",
          "content": "We reserve the right to refuse or cancel Your Order at any time for certain reasons including but not limited to: Goods availability, Errors in the description or prices for Goods, Errors in Your Order."
        },
        {
          "title": "Availability, Errors, and Inaccuracies",
          "content": "We regularly update the assortment of goods on our Service. The Goods featured on our Service might be subject to pricing errors, inaccurate descriptions, or unavailability. We may encounter delays in updating information about our Goods on the Service and in Our advertisements on other platforms."
        },
        {
          "title": "Prices Policy",
          "content": "The Company reserves the right to revise its prices at any time prior to accepting an Order."
        },
        {
          "title": "Payments",
          "content": "Purchased Goods are subject to a one-time payment. Payments can be completed through a variety of available payment methods, including Visa, MasterCard, Affinity Card, American Express cards, or online payment methods (such as PayPal)."
        },
        {
          "title": "Subscriptions",
          "subsections": [
            {
              "subtitle": "Subscription period",
              "content": "The Service or some parts of the Service are available only with a paid Subscription."
            },
            {
              "subtitle": "Subscription Cancellations",
              "content": "Your subscription will automatically renew under the same terms at the end of each period unless you cancel it or the Company cancels it."
            },
            {
              "subtitle": "Billing",
              "content": "Where applicable, you are required to provide the Company with precise and comprehensive billing details."
            },
            {
              "subtitle": "Fee Changes",
              "content": "The Company reserves the right, at its sole discretion and at any time, to alter the subscription fees of any or all Subscription options."
            },
            {
              "subtitle": "Refunds",
              "content": "Paid Subscription fees are non-refundable except when required by law."
            }
          ]
        },
        {
          "title": "Intellectual Property",
          "content": "The Service, along with its original content (excluding content provided by You or other users), features, and functionality, is and will continue to be the exclusive property of the Company and its licensors."
        },
        {
          "title": "Your Feedback to Us",
          "content": "By providing the Company with feedback, you hereby assign all rights, title, and interest in that feedback."
        },
        {
          "title": "Links to Other Websites",
          "content": "Our Service may include links to third-party websites or services that are not owned or controlled by the Company."
        },
        {
          "title": "Termination",
          "content": "Your access may be terminated or suspended immediately, without prior notice or liability, for any reason, including, but not limited to, a breach of these Terms and Conditions."
        },
        {
          "title": "Limitation of Liability",
          "content": "Regardless of any damages you may incur, the total liability of the Company and its suppliers under any provision of these Terms, and your exclusive remedy for all such matters, will be limited to the amount actually paid by you through the Service or $10 USD if you haven't made any purchases through the Service."
        }
      ]
    }
  ]
}
