{
  "terms": [
    {
      "title": "Interpretation and Definitions",
      "sections": [
        {
          "title": "Interpretation",
          "content": "The words of which the initial letter is capitalized have meanings defined under the following conditions. The following definitions shall have the same meaning regardless of whether they appear in singular or in plural."
        },
        {
          "title": "Definitions",
          "content": "For the purposes of these Terms and Conditions :",
          "list": [
            {
              "term": "Application",
              "definition": "means the software program provided by the Company downloaded or added to a Platform by You on any electronic device, named Agent and/or Agent Connect."
            },
            {
              "term": "Application Store",
              "definition": "means the digital distribution service operated and developed by Apple Inc. (Apple App Store) or Google Inc. (Google Play Store) in which the Application has been downloaded."
            },
            {
              "term": "Affiliate",
              "definition": "means an entity that controls, is controlled by or is under common control with a party, where 'control' means ownership of 50% or more of the shares, equity interest or other securities entitled to vote for election of directors or other managing authority."
            },
            {
              "term": "Company",
              "definition": " (referred to as either 'the Company', 'We', 'Us' or 'Our' in this Agreement) refers to Omiage - 33 Bd. de Ladonne, 33600 Pessac (France)."
            },
            {
              "term": "Device",
              "definition": "means any device that can access the Service including but not limited to a computer, a cellphone, or a digital tablet."
            },
            {
              "term": "Feedback",
              "definition": "means feedback, innovations, or suggestions sent by You regarding the attributes, performance, or features of our Service."
            },
            {
              "term": "Goods",
              "definition": "refer to the items offered for sale on the Service for a one-time payment."
            },
            {
              "term": "Orders",
              "definition": "mean a request by You to purchase Goods from Us."
            },
            {
              "term": "Platform",
              "definition": "is any third-party that the Service is made possible through the download of the Application to their service."
            },
            {
              "term": "Promotions",
              "definition": "refer to contests, sweepstakes, or other promotions offered through the Service."
            },
            {
              "term": "Service",
              "definition": "refers to the Application."
            },
            {
              "term": "Subscriptions",
              "definition": "refer to the services or access to the Service offered on a subscription basis by the Company to You."
            },
            {
              "term": "Terms and Conditions",
              "definition": "mean these Terms and Conditions that form the entire agreement between You and the Company regarding the use of the Service."
            },
            {
              "term": "Third-party Social Media Service",
              "definition": "means any services or content (including data, information, products or services) provided by a third-party social media platform that may be displayed, included, or made available by the Service."
            },
            {
              "term": "Third-party Website",
              "definition": "means any services or content (including data, information, products, or services) provided by a third-party website that may be displayed, included, or made available by the Service."
            },
            {
              "term": "Website",
              "definition": "refers to Agent’s website, accessible from https://agent-bfcommunity.com."
            },
            {
              "term": "You",
              "definition": "means the individual accessing or using the Service, or the company, or other legal entity on behalf of which such individual is accessing or using the Service, as applicable."
            }
          ]
        }
      ]
    },
    {
      "title": "Acknowledgment",
      "content": "These are the Terms and Conditions governing the use of this Service  and the agreement that operates between You and the Company. These Terms and Conditions set out the rights and obligations of all users regarding the use of the Service. Your access to and use of the Service is conditioned on Your acceptance of and compliance with these Terms and Conditions. These  Terms and Conditions apply to all visitors, users, and others who access or use the Service. By accessing or using the Service You agree to be bound by these  Terms and Conditions. If You disagree with any part of these Terms and Conditions, then You may not access the Service. You represent that you are over the age of 18. The Company does not permit those under 18 to use the Service. Your ability to access and utilize the Service is contingent upon your acceptance of and adherence to the Company's Privacy Policy. The Privacy Policy outlines our practices regarding the collection, utilization, and disclosure of your personal information when using the  Application or the Website. It provides information about your privacy  rights and legal protections. Please review our Privacy Policy  thoroughly before engaging with our Service."
    },
    {
      "title": "Placing Orders for Goods",
      "content": "By placing an Order for Goods through the Service, You warrant that You are legally capable of entering into binding contracts."
    },
    {
      "title": "Your Information",
      "content": "If You wish to place an Order for Goods available on the Service, You may be asked to supply certain information relevant to Your Order  including, without limitation, Your name, Your email, Your phone number, Your credit card number, the expiration date of Your credit card, Your  billing address, and Your shipping information. You represent and warrant that: (i) You have the legal right to use  any credit or debit card(s) or other payment method(s) in connection  with any Order; and that (ii) the information You supply to us is true,  correct and complete. By submitting such information, You grant us the right to provide the information to payment processing third parties for purposes of  facilitating the completion of Your Order."
    },
    {
      "title": "Order Cancellation",
      "content": "We reserve the right to refuse or cancel Your Order at any time for certain reasons including but not limited to:",
      "list": [
        {
          "definition": "Goods availability"
        },
        {
          "definition": "Errors in the description or prices for Goods"
        },
        {
          "definition": "Errors in Your Order"
        }
      ],
      "footer": "We reserve the right to refuse or cancel Your Order if fraud or an unauthorized or illegal transaction is suspected."
    },
    {
      "title": "Availability, Errors, and Inaccuracies",
      "content": "We regularly update the assortment of goods on our Service. The Goods featured on our Service might be subject to pricing errors, inaccurate descriptions, or unavailability. We may encounter delays in updating information about our Goods on the Service and in Our advertisements on other platforms. We cannot assure the accuracy or completeness of any information, including prices, product images, specifications, availability, and services. We retain the right to modify or update information and rectify errors, inaccuracies, or omissions at any time without prior notice."
    },
    {
      "title": "Prices Policy",
      "content": "The Company reserves the right to revise its prices at any time prior to accepting an Order.\n The Company reserves the right to adjust the quoted prices after accepting an order in the event of any circumstances impacting delivery, such as government actions, changes in customs duties, increased  foreign exchange costs, or any other factors beyond the Company's control.",
      "sections": [
        {
          "title": "Payments",
          "content": "Purchased Goods are subject to a one-time payment. Payments can be completed through a variety of available payment methods, including Visa, MasterCard, Affinity Card, American Express cards, or online payment methods (such as PayPal).\n Credit cards or debit cards used for payment are subject to validation checks and authorization by your card issuer. If the necessary authorization is not received, we will not be held responsible for any delay or non-delivery of your order."
        },
        {
          "title": "Subscriptions",
          "sections": [
            {
              "title": "Subscription period",
              "content": "The Service or some parts of the Service are available only with a  paid Subscription. You will be billed in advance on a recurring and  periodic basis (such as monthly or annually), depending on the type of  Subscription plan you select when purchasing the Subscription. At the end of each period, Your Subscription will automatically renew under the exact same conditions unless You cancel it or the Company  cancels it."
            },
            {
              "title": "Subscription Cancellations",
              "content": "Access to the Service, or certain sections of it, requires a paid  subscription. You will be charged in advance at regular intervals (such  as monthly or annually), depending on the subscription plan you choose  during the purchase. Your subscription will automatically renew under the same terms at  the end of each period unless you cancel it or the Company cancels it."
            }
          ]
        },
        {
          "title": "Billing",
          "content": "Where applicable, you are required to provide the Company with precise and comprehensive billing details, encompassing your full name, address, state, zip code, telephone number, and valid payment method information.\n In the event of a failure in automatic billing, the Company will issue an electronic invoice. You must manually complete the full payment for the specified billing period within a designated deadline date as  indicated on the invoice."
        },
        {
          "title": "Fee Changes",
          "content": "The Company reserves the right, at its sole discretion and at any  time, to alter the subscription fees of any or all Subscription options. Any changes to the subscription fees will take effect at the conclusion of the current subscription period."
        },
        {
          "title": "Refunds",
          "content": "Paid Subscription fees are non-refundable except when required by law.\n Certain refund requests for Subscriptions may be considered by the Company on a case-by-case basis and granted at the sole discretion of  the Company."
        },
        {
          "title": "Promotions",
          "content": "Any Promotions made available through the Service may be governed by rules that are separate from these Terms. If You participate in any Promotions, please review the applicable rules as well as our Privacy policy. In the event the rules for a Promotion conflict with these Terms, the Promotion rules will take precedence."
        }
      ]
    },
    {
      "title": "Intellectual Property",
      "content": "The Service, along with its original content (excluding content  provided by You or other users), features, and functionality, is and  will continue to be the exclusive property of the Company and its licensors. It is safeguarded by copyright, trademark, and other laws in  both the Country and foreign jurisdictions. The use of our trademarks  and trade dress in connection with any product or service requires the  prior written consent of the Company."
    },
    {
      "title": "Your Feedback to Us",
      "content": "By providing the Company with feedback, you hereby assign all rights, title, and interest in that feedback. In the event this assignment is ineffective for any reason, you agree to provide the Company with a non-exclusive, perpetual, irrevocable, royalty-free, worldwide right and license to use, reproduce, disclose, sublicense, distribute, and modify the feedback without any restrictions."
    },
    {
      "title": "Links to Other Websites",
      "content": "Our Service may include links to third-party websites or services that are not owned or controlled by the Company.\n The Company has no authority over, and assumes no responsibility for, the content, privacy policies, or practices of any third-party websites or services. You acknowledge and agree that the Company is not liable, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any such content, goods, or services available on or through any third-party websites or services.\n We strongly recommend reading the terms and conditions as well as the privacy policies of any third-party websites or services you visit."
    },
    {
      "title": "Termination",
      "content": "Your access may be terminated or suspended immediately, without prior notice or liability, for any reason, including, but not limited to, a breach of these Terms and Conditions."
    },
    {
      "title": "Limitation of Liability",
      "content": "Regardless of any damages you may incur, the total liability of the Company and its suppliers under any provision of these Terms, and your exclusive remedy for all such matters, will be limited to the amount actually paid by you through the Service or $10 USD if you haven't made  any purchases through the Service.\n To the fullest extent permitted by applicable law, in no event shall the Company or its suppliers be liable for any special, incidental,  indirect, or consequential damages whatsoever (including, but not limited to, damages for loss of profits, loss of data or other  information, for business interruption, for personal injury, loss of  privacy arising out of or in any way related to the use of or inability  to use the Service, third-party software and/or third-party hardware  used with the Service, or otherwise in connection with any provision of  this Terms), even if the Company or any supplier has been advised of the possibility of such damages and even if the remedy fails in its  intended purpose.\n Some states do not allow the exclusion of implied warranties or  limitation of liability for incidental or consequential damages, which  means that some of the above limitations may not apply. In these states, each party's liability will be limited to the greatest extent permitted by law."
    },
    {
      "title": "\"AS IS\" and \"AS AVAILABLE\" Disclaimer",
      "content": "The Service is provided to You \"AS IS\" and \"AS AVAILABLE\" and with all faults and defects without warranty of any kind. To the maximum extent permitted under applicable law, the Company, on its own behalf and on behalf of its Affiliates and its and their respective licensors and service providers, expressly disclaims all warranties, whether express, implied, statutory, or otherwise, with respect to the Service, including all implied warranties of merchantability, fitness for a particular purpose, title, and non-infringement, and warranties that may arise out of course of dealing, course of performance, usage, or trade practice. Without limitation to the foregoing, the Company provides no warranty or undertaking, and makes no representation of any kind that the Service will meet Your requirements, achieve any intended results,  be compatible or work with any other software, applications, systems or  services, operate without interruption, meet any performance or  reliability standards, or be error-free or that any errors or defects can or will be corrected.\n Without limiting the foregoing, neither the Company nor any of the company's provider makes any representation or warranty of any kind, express or implied: (i) as to the operation or availability of the Service, or the information, content, and materials or products included thereon; (ii) that the Service will be uninterrupted or error-free; (iii) as to the accuracy, reliability, or currency of any information or content provided through the Service; or (iv) that the Service, its servers, the content, or e-mails sent from or on behalf of the Company are free of viruses, scripts, trojan horses, worms, malware, timebombs, or other harmful components.\n Some jurisdictions do not allow the exclusion of certain types of  warranties or limitations on applicable statutory rights of a consumer,  so some or all of the above exclusions and limitations may not apply to You. In such a case, the exclusions and limitations set forth in this section shall be applied to the greatest extent enforceable under  applicable law."
    },
    {
      "title": "Governing Law",
      "content": "The laws of the Country, excluding its conflicts of law rules, shall  govern this Terms and Your use of the Service. Your use of the  Application may also be subject to other local, state, national, or international laws.",
      "sections": [
        {
          "title": "Disputes Resolution",
          "content": "If You have any concern or dispute about the Service, You agree to first try to resolve the dispute informally by contacting the Company."
        },
        {
          "title": "For European Union (EU) Users",
          "content": "If You are a European Union consumer, you will benefit from any mandatory provisions of the law of the country in which you are resident in."
        },
        {
          "title": "United States Federal Government End Use Provisions",
          "content": "If You are a U.S. federal government end user, our Service is a \"Commercial Item\" as that term is defined at 48 C.F.R. §2.101."
        },
        {
          "title": "United States Legal Provisions",
          "content": "You represent and warrant that: (i) You are not located in a country that is subject to the United  States government embargo, or that has been designated by the United States government as a \"terrorist supporting\" country, and (ii) You are not listed on any United States government list of  prohibited or restricted parties."
        }
      ]
    },
    {
      "title": "Severability and Waiver",
      "sections": [
        {
          "title": "Severability",
          "content": "If any provision of these Terms is held to be unenforceable or invalid, such provision will be changed and interpreted to accomplish the objectives of such provision to the greatest extent possible under applicable law, and the remaining provisions will continue in full force and effect."
        },
        {
          "title": "Waiver",
          "content": "Except as provided herein, the failure to exercise a right or to require performance of an obligation under these Terms shall not affect a party's ability to exercise such right or require such performance at any time thereafter, nor shall the waiver of a breach constitute a  waiver of any subsequent breach."
        },
        {
          "title": "Translation Interpretation",
          "content": "These Terms and Conditions may have been translated if We have made them available to You on our Service. You agree that the original English text shall prevail in the case of a dispute."
        }
      ]
    },
    {
      "title": "Changes to these Terms and Conditions",
      "content": "We reserve the right, at Our sole discretion, to modify or replace these Terms at any time. If a revision is material, we will make  reasonable efforts to provide at least 30 days' notice prior to any new  terms taking effect. What constitutes a material change will be  determined at Our sole discretion.\n By continuing to access or use Our Service after those revisions  become effective, You agree to be bound by the revised terms. If You do not agree to the new terms, in whole or in part, please do not use the  website and the Service."
    },
    {
      "title": "Contact Us",
      "content": "If you have any questions about these Terms and Conditions, you can contact us by email : agent.opensource@gmail.com",
      "list": []
    }
  ],
  "privacy": [
    {
      "title": "Introduction",
      "content": "Omiage, sole proprietorship, d/b/a Agent (\"Agent,\" \"we,\" \"us,\" or \"our\") is committed to protecting the privacy and security of your personal information. We have prepared this Privacy Policy to explain how we collect, use, share, and protect your personal data when you use Agent website and the services provided through it. By accessing or using our website, you agree to the practices described in this policy."
    },
    {
      "title": "Information we collect",
      "sections": [
        {
          "title": "Information We Collect",
          "content": "We may collect personal information that you provide voluntarily, such as your username, email address, discord handle, and payment information. We may also collect information about your marketplace transactions."
        },
        {
          "title": "Public Information",
          "content": "We may collect data from activity and information that is publicly visible and/or accessible on blockchains or other public sources. This may include, for example, blockchain wallet addresses and information regarding purchases, sales, or transfers of NFTs, which may then be associated with other data you have provided to us."
        },
        {
          "title": "Preferences",
          "content": "Our Service allows you to store preferences including how website content is displayed, notification settings, and favorites. We may associate these choices with your account, browser, and/or mobile device."
        },
        {
          "title": "Automatically Collected Information",
          "content": "We may collect information about your device and how you interact with our website, including your IP address, browser type, and operating system. We may also use cookies, web beacons, and similar technologies to collect data for analytics and personalized content."
        },
        {
          "title": "Other Information",
          "content": "We also collect information and other data at various points in our Service where you voluntarily provide it or where we state that your information is being collected."
        }
      ]
    },
    {
      "title": "How we use your information",
      "sections": [
        {
          "title": "Provide Services",
          "content": "To provide you with access to Agent and its services, including calculating portfolio metrics, analyzing trends, and providing customer support."
        },
        {
          "title": "Personalization",
          "content": "To personalize your experience and improve the content and functionality of our website."
        },
        {
          "title": "Marketing",
          "content": "To send you promotional materials, newsletters, and other information about our products and services if you have opted in to receive such communications."
        },
        {
          "title": "Compliance",
          "content": "To comply with legal requirements and obligations and to enforce our Terms of Service."
        },
        {
          "title": "Anonymized Records",
          "content": "We may create anonymized records from identifiable information. We use this data for the same purposes as outlined above, including to improve our Service. We reserve the right to use and/or disclose anonymized information for any purpose."
        }
      ]
    },
    {
      "title": "How we share your information",
      "sections": [
        {
          "title": "Third Party Service Providers",
          "content": "We may share your data with third-party service providers to help us operate our website and/or provide other services; analyze how our Service is used; prevent, detect, and respond to unauthorized activities or potential violations of our Terms of Service or policies; and/or provide technical support."
        },
        {
          "title": "Legal Obligations",
          "content": "We may disclose your information if deemed necessary: to comply with legal obligations, to respond to subpoenas, warrants or other legal process served on Agent; or to protect our rights."
        },
        {
          "title": "Business Transfers",
          "content": "If Vast Impact Gaming, LLC undergoes a change in ownership or is involved in a merger, your data may be transferred to the new entity."
        },
        {
          "title": "Other Disclosures",
          "content": "We may also disclose your information and information about you: to fulfill the purpose for which you provide it, including to provide you with our Service and new features ; for any other purpose disclosed by us when you provide it; or with your consent."
        }
      ]
    },
    {
      "title": "Security of your information",
      "content": "We implement security measures to protect your data, but no method of transmission over the internet is 100% secure. We cannot guarantee the security of your data."
    },
    {
      "title": "your choices and rights",
      "sections": [
        {
          "title": "Access and Correction",
          "content": "You can access and update your personal information by making changes directly to your Profile page or by contacting us at agent.opensource@gmail.com."
        },
        {
          "title": "Marketing Communications",
          "content": "You can opt out of receiving marketing communications by following the instructions in those communications, by selecting the ‘Marketing Opt-Out’ option on your Profile page, or by contacting us at agent.opensource@gmail.com."
        },
        {
          "title": "Cookies",
          "content": "If you decide at any time that you no longer wish to accept cookies from our Service for any of the purposes described above, you can change your browser settings to stop accepting cookies or to prompt you before accepting a cookie from the websites you visit."
        }
      ]
    },
    {
      "title": "Third party websites",
      "content": "Our Service may contain links to third-party websites. When you click on a link to any other website or location, you will leave our Service and go to another site, and another entity may collect information from you. We have no control over and cannot be responsible for these third-party websites or their content."
    },
    {
      "title": "Data access and control",
      "sections": [
        {
          "title": "EEA, UK, or Switzerland users",
          "content": "Users in the EEA, UK, or Switzerland have the right to request access and obtain a copy of their personal information, request rectification or erasure, object to or restrict processing, and request portability of their personal information."
        },
        {
          "title": "California residents",
          "content": "California residents have certain rights under the California Privacy Rights Act (CPRA), including the right to request access to, details regarding, and a copy of their personal information, request deletion, and opt-out of the sale of personal information."
        }
      ]
    },
    {
      "title": "Data retention",
      "content": "If you request the deletion of your data, we may retain your information if it is necessary to comply with legal obligations, resolve disputes, prevent fraud and abuse, enforce our Terms, and protect our legal rights."
    },
    {
      "title": "Security",
      "content": "We prioritize the security of your information and employ physical, administrative, and technological measures to uphold the integrity and safety of the data collected through our Service. Nevertheless, no security system is entirely impervious."
    },
    {
      "title": "Minors",
      "content": "We do not intentionally collect information from individuals under the age of 13. If we become aware of such a case, we will make efforts to promptly delete the information."
    },
    {
      "title": "California privacy rights disclosure",
      "content": "The categories of personal information we collect include: (1) identifiers, (2) commercial information, (3) internet or online identifiers, (4) geolocation data, and (5) information derived from other personal information about you."
    },
    {
      "title": "Changes to privacy policy",
      "content": "We may update this Privacy Policy from time to time. When we do, we will revise the ‘Last Updated’ date and publish the latest version."
    },
    {
      "title": "Contact us",
      "content": "If you have any questions or concerns about this Privacy Policy, please contact us at agent.opensource@gmail.com."
    }
  ]
}
